In [19]:
import numpy as np

Series 데이터

Pandas
:파이썬 라이브러리, 구조화된데이터를 효과적으로 처리하고 저장,
    array계산에 특화된 Numpy를 기반으로 설계

Series:numpy array가 보강된 형태, Data와 Index를 가지고 있음

In [2]:
import pandas as pd

data = pd.Series([1, 2, 3, 4])
print(data)

0    1
1    2
2    3
3    4
dtype: int64

인덱스를 가지고 있고 인데긋로 접근 가능

In [3]:
data = pd.Series([1,2,3,4], index=['a','b','c','d'])
print(data)
print(data['b'])

a    1
b    2
c    3
d    4
dtype: int64
2

name 인자로 이름을 지정할 수 있음

In [4]:
data = pd.Series([1, 2, 3, 4], index=['a','b','c','d'], name="Title")
d_d= data['c'] = 5
print(d_d)
print(data)

5
a    1
b    2
c    5
d    4
Name: Title, dtype: int64

딕셔너리로 변환

In [5]:
population_dict = {
    'korea': 5180,
    'japan':12718,
    'china':141500,
    'usa':32676
}

population = pd. Series(population_dict)
print(population)

korea      5180
japan     12718
china    141500
usa       32676
dtype: int64

DataFrame 여러개의 Series가 모여서 행과 열을 이룬 데이터

In [6]:
gdp_dict={
    'korea': 169320000,
    'japan' : 516700000,
    'china' : 1409250000,
    'usa' : 2041280000
}
gdp = pd.Series(gdp_dict)
country = pd.DataFrame({
    'population':population,
    'gdp': gdp
})
print(country)

       population         gdp
korea        5180   169320000
japan       12718   516700000
china      141500  1409250000
usa         32676  2041280000

In [7]:
print(country.index)
print(country.columns)
print(country['gdp'])
print(type(country['gdp']))

Index(['korea', 'japan', 'china', 'usa'], dtype='object')
Index(['population', 'gdp'], dtype='object')
korea     169320000
japan     516700000
china    1409250000
usa      2041280000
Name: gdp, dtype: int64
<class 'pandas.core.series.Series'>

Series도 numpy array 처럼 연산자를 활용

In [8]:
gdp_per_capita = country['gdp']/country['population']
print(gdp_per_capita)
country['gdp per capita'] = gdp_per_capita
print(country)

korea    32687.258687
japan    40627.457147
china     9959.363958
usa      62470.314604
dtype: float64
       population         gdp  gdp per capita
korea        5180   169320000    32687.258687
japan       12718   516700000    40627.457147
china      141500  1409250000     9959.363958
usa         32676  2041280000    62470.314604

저장과 불러오기

데이터 프레임을 저장

In [82]:
country.to_csv("./country.csv")

In [86]:
country = pd.read_csv("./country.csv")

In [87]:
print(country)

  Unnamed: 0  population         gdp  gdp per capita
0      korea        5180   169320000    32687.258687
1      japan       12718   516700000    40627.457147
2      china      141500  1409250000     9959.363958
3        usa       32676  2041280000    62470.314604

indexing/slicing

.loc:명시적인 인덱스를 참조하는 인덱싱/슬라이싱

In [9]:
country.loc['china']

population        1.415000e+05
gdp               1.409250e+09
gdp per capita    9.959364e+03
Name: china, dtype: float64

In [10]:
country.loc['japan':'korea', :'population']

Empty DataFrame
Columns: [population]
Index: []

Indexing/Slicing

.iloc: 파이썬 스타일 정수 인덱스 인덱싱/슬라이싱

In [11]:
country.iloc[0]

population        5.180000e+03
gdp               1.693200e+08
gdp per capita    3.268726e+04
Name: korea, dtype: float64

In [12]:
country.iloc[1:3, :2]

       population         gdp
japan       12718   516700000
china      141500  1409250000

In [13]:
country.iloc[: , :]

       population         gdp  gdp per capita
korea        5180   169320000    32687.258687
japan       12718   516700000    40627.457147
china      141500  1409250000     9959.363958
usa         32676  2041280000    62470.314604

DataFrame 새 데이터 추가/ 수정

리스트로 추가 or 딕셔너리로 추가

In [14]:
dataframe = pd.DataFrame(columns=['이름','나이','주소'])
print(dataframe)

Empty DataFrame
Columns: [이름, 나이, 주소]
Index: []

In [17]:
dataframe.loc[0]=['임원균', '26', '서울']
dataframe.loc[1]={'이름':'철수', '나이':'25', '주소':'인천'}
dataframe.loc[1,'이름'] = '영희'
print(dataframe)

    이름  나이  주소
0  임원균  26  서울
1   영희  25  인천

새로운 컬럼 추가

In [21]:
dataframe['전화번호'] = np.nan
print(dataframe)
print()
dataframe.loc[0, '전화번호'] = '01012341234'
print(dataframe)
len(dataframe)

    이름  나이  주소  전화번호
0  임원균  26  서울   NaN
1   영희  25  인천   NaN

    이름  나이  주소         전화번호
0  임원균  26  서울  01012341234
1   영희  25  인천          NaN

2

컬럼 선택하기

컬럼 이름이 하나만 있다면 Series, 리스트로 들어가 있다면 DataFrame

In [23]:
dataframe["이름"]

0    임원균
1     영희
Name: 이름, dtype: object

In [24]:

dataframe[["이름","주소","나이"]]

    이름  주소  나이
0  임원균  서울  26
1   영희  인천  25

누락된 데이터 체크

튜토리얼의 데이터와 다르게 현실 데이터는 일부 누락되어 있는 형태가 많음

In [25]:
dataframe.isnull()

      이름     나이     주소   전화번호
0  False  False  False  False
1  False  False  False   True

In [26]:
dataframe.notnull()

     이름    나이    주소   전화번호
0  True  True  True   True
1  True  True  True  False

In [27]:
dataframe.dropna()

    이름  나이  주소         전화번호
0  임원균  26  서울  01012341234

In [28]:
dataframe['전화번호'] = dataframe['전화번호'].fillna('전화번호 없음')

In [29]:
dataframe

    이름  나이  주소         전화번호
0  임원균  26  서울  01012341234
1   영희  25  인천      전화번호 없음

Series 연산

numpy array에서 사용했던 Series 연산자들을 동일하게 활용할 수 있음

In [32]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
print(A)
print()
print(B)
print()
print(A+B)

0    2
1    4
2    6
dtype: int64

1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [33]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

DataFrame 연산

add(+), sub(-), mul(*), div(/)

In [37]:
A = pd.DataFrame(np.random.randint(0, 10, (2,2)), columns=list("AB"))
print(A)
print()
B = pd.DataFrame(np.random.randint(0, 10, (3,3)), columns=list("BAC"))
print(B)
print()

print(A+B)
print()

print(A.add(B, fill_value=0))

   A  B
0  7  1
1  5  4

   B  A  C
0  3  7  1
1  1  6  7
2  9  5  3

      A    B   C
0  14.0  4.0 NaN
1  11.0  5.0 NaN
2   NaN  NaN NaN

      A    B    C
0  14.0  4.0  1.0
1  11.0  5.0  7.0
2   5.0  9.0  3.0

집계함수

numpy array에서 사용했던 sum, mean 등의 집계함수를 동일하게 사용할 수 있음

In [41]:
data = {
    'A':[i+5 for i in range(3)],
    'B':[i**2 for i in range(3)]
}
df = pd.DataFrame(data)
print(df)
print()
print(df['A'].sum())
print(df.sum())
print(df.mean())

   A  B
0  5  0
1  6  1
2  7  4

18
A    18
B     5
dtype: int64
A    6.000000
B    1.666667
dtype: float64

Dataframe 정렬하기

값으로 정렬하기
sort_values()

In [43]:
df = pd.DataFrame({
    'col1' : [2,1,9,8,7,4],
    'col2' : ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col3' : [0, 1, 9, 4, 2, 3]
})
print(df)

   col1 col2  col3
0     2    A     0
1     1    A     1
2     9    B     9
3     8  NaN     4
4     7    D     2
5     4    C     3

In [44]:
df.sort_values('col1')

   col1 col2  col3
1     1    A     1
0     2    A     0
5     4    C     3
4     7    D     2
3     8  NaN     4
2     9    B     9

In [47]:
df.sort_values('col1', ascending=False) #ascending을 쓰니 역순으로나옴

   col1 col2  col3
2     9    B     9
3     8  NaN     4
4     7    D     2
5     4    C     3
0     2    A     0
1     1    A     1

In [48]:
df.sort_values(['col2','col1'])

   col1 col2  col3
1     1    A     1
0     2    A     0
2     9    B     9
5     4    C     3
4     7    D     2
3     8  NaN     4